; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-84)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - object)
 (:init 
    (arm-empty)
    (clear b10)
    (on b10 b2)
    (on b2 b1)
    (on b1 b21)
    (on b21 b15)
    (on b15 b19)
    (on b19 b9)
    (on b9 b4)
    (on b4 b17)
    (on b17 b5)
    (on b5 b12)
    (on b12 b18)
    (on b18 b23)
    (on b23 b24)
    (on b24 b3)
    (on b3 b8)
    (on b8 b20)
    (on-table b20)
    (clear b22)
    (on-table b22)
    (clear b6)
    (on b6 b14)
    (on b14 b13)
    (on b13 b25)
    (on b25 b16)
    (on b16 b11)
    (on b11 b7)
    (on-table b7))
 (:goal (and 
(on b20 b22)
))
)

; plan
1. (unstack b10 b2)
   deleted: (on b10 b2) (clear b10) (arm-empty)
   added: (holding b10) (clear b2)
   goals met: 0 of 1
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
3. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 0 of 1
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
5. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 0 of 1
6. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
7. (unstack b21 b15)
   deleted: (on b21 b15) (clear b21) (arm-empty)
   added: (holding b21) (clear b15)
   goals met: 0 of 1
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
9. (unstack b15 b19)
   deleted: (on b15 b19) (clear b15) (arm-empty)
   added: (holding b15) (clear b19)
   goals met: 0 of 1
10. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
11. (unstack b19 b9)
   deleted: (on b19 b9) (clear b19) (arm-empty)
   added: (holding b19) (clear b9)
   goals met: 0 of 1
12. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
13. (unstack b9 b4)
   deleted: (on b9 b4) (clear b9) (arm-empty)
   added: (holding b9) (clear b4)
   goals met: 0 of 1
14. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
15. (unstack b4 b17)
   deleted: (on b4 b17) (clear b4) (arm-empty)
   added: (holding b4) (clear b17)
   goals met: 0 of 1
16. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
17. (unstack b17 b5)
   deleted: (on b17 b5) (clear b17) (arm-empty)
   added: (holding b17) (clear b5)
   goals met: 0 of 1
18. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
19. (unstack b5 b12)
   deleted: (on b5 b12) (clear b5) (arm-empty)
   added: (holding b5) (clear b12)
   goals met: 0 of 1
20. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
21. (unstack b12 b18)
   deleted: (on b12 b18) (clear b12) (arm-empty)
   added: (holding b12) (clear b18)
   goals met: 0 of 1
22. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
23. (unstack b18 b23)
   deleted: (on b18 b23) (clear b18) (arm-empty)
   added: (holding b18) (clear b23)
   goals met: 0 of 1
24. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
25. (unstack b23 b24)
   deleted: (on b23 b24) (clear b23) (arm-empty)
   added: (holding b23) (clear b24)
   goals met: 0 of 1
26. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 1
27. (unstack b24 b3)
   deleted: (on b24 b3) (clear b24) (arm-empty)
   added: (holding b24) (clear b3)
   goals met: 0 of 1
28. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 1
29. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 0 of 1
30. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
31. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 0 of 1
32. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
33. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 0 of 1
34. (stack b20 b22)
   deleted: (clear b22) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b22)
   goals met: 1 of 1
